In [3]:
import pandas as pd
import numpy as np
from numpy import nan as NA

In [4]:
df = pd.DataFrame([['2018-03-24',34,23,34],['2018-04-01',23],['2018-04-05',25,21],['2018-06-01',54,13,24],['2018-08-04',2],['2018-09-15',2,56,23]], columns=['Date Column',1,2,3])
df

  Date Column   1     2     3
0  2018-03-24  34  23.0  34.0
1  2018-04-01  23   NaN   NaN
2  2018-04-05  25  21.0   NaN
3  2018-06-01  54  13.0  24.0
4  2018-08-04   2   NaN   NaN
5  2018-09-15   2  56.0  23.0

In [5]:
df['Date Column'] = pd.to_datetime(df['Date Column'])
df['Date Column']

0   2018-03-24
1   2018-04-01
2   2018-04-05
3   2018-06-01
4   2018-08-04
5   2018-09-15
Name: Date Column, dtype: datetime64[ns]

In [6]:
df2 = df.fillna(0)
df2

  Date Column   1     2     3
0  2018-03-24  34  23.0  34.0
1  2018-04-01  23   0.0   0.0
2  2018-04-05  25  21.0   0.0
3  2018-06-01  54  13.0  24.0
4  2018-08-04   2   0.0   0.0
5  2018-09-15   2  56.0  23.0